/*
 *2.	Да се напише програма, която чете час и минути от 24-часово денонощие, въведени
 *от потребителя, и изчислява колко ще е часът след 15 минути. Резултатът да се
 *отпечата във формат hh:mm. Часовете винаги са между 0 и 23, а минутите винаги
 *са между 0 и 59. Часовете се изписват с една или две цифри. Минутите се изписват
 *винаги с по две цифри, с водеща нула когато е необходимо. Примери:
вход	изход		вход	изход		вход	изход		вход	изход		вход	изход
1
46	2:01		0
01	0:16		23
59	0:14		11
08	11:23		12
49	13:04
*/

#include <stdio.h>

int main() {
    int hour, minutes;

    printf("Vuvedete chas (0-23): ");
    scanf("%d", &hour);

    printf("Vuvedete minuti (0-59): ");
    scanf("%d", &minutes);

    minutes += 15;

    if (minutes >= 60) {
        hour += minutes / 60;
        minutes = minutes % 60;
    }

    if (hour >= 24) {
        hour = hour % 24;
    }

    printf("Chasut sled 15 minuti shte bude: %d:%02d\n", hour, minutes);

    return 0;
}



//
// Created by Admin on 3/12/2026.
//