/*
 *1. Напишете функция, която получава две числа и връща по-голямото от тях.
 *Направете същото и за по-малкото. Демонстрирайте работата на функциите като четете
 *множество числа до въвеждане на 0 и изкарате най-голямото въведено и най-малкото въведено
 *число.
 */

#include <stdio.h>

int max(int a, int b) {
    if (a > b)
        return a;
    else
        return b;
}

int min(int a, int b) {
    if (a < b)
        return a;

}












//
// Created by Admin on 3/12/2026.
//