/*
*4.	Дадено е цяло число – брой точки. Върху него се начисляват бонус точки по
*правилата, описани по-долу. Да се напише програма, която пресмята бонус точките за
*това число и общия брой точки с бонусите.
●	Ако числото е до 100 включително, бонус точките са 5.
●	Ако числото е по-голямо от 100, бонус точките са 20% от числото.
●	Ако числото е по-голямо от 1000, бонус точките са 10% от числото.
●	Допълнителни бонус точки (начисляват се отделно от предходните):
o	За четно число 🡪 + 1 т.
o	За число, което завършва на 5 🡪 + 2 т.
Примери:
вход	изход		вход	изход		вход	изход		вход	Изход
20	6
26		175	37
212		2703	270.3
2973.3		15875	1589.5
17464.5
*/

#include <stdio.h>

int main() {
    int points;
    double bonus = 0.0;

    printf("Vuvedete broi tochki: ");
    scanf("%d", &points);

    // Основен бонус
    if (points <= 100) {
        bonus = 5;
    }
    else if (points <= 1000) {
        bonus = points * 0.20;
    }
    else {
        bonus = points * 0.10;
    }

    // Допълнителни бонуси
    if (points % 2 == 0) {
        bonus += 1;
    }

    if (points % 10 == 5) {
        bonus += 2;
    }

    printf("Bonus tochki: %.1f\n", bonus);
    printf("Obsht broi tochki: %.1f\n", points + bonus);

    return 0;
}



//
// Created by Admin on 3/12/2026.
//